brew "xz"
brew "automake"
brew "openssl@3"
brew "bat"
brew "bfg"
brew "bison"
brew "chruby"
brew "fd"
brew "fzf"
brew "gcc"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "jq"
brew "libffi"
brew "libyaml"
brew "make"
brew "open-mpi"
brew "opencl-headers"
brew "pdf2svg"
brew "pdfgrep"
brew "pdftk-java"
brew "pygments"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "tldr"
brew "tree"
brew "weasyprint"
cask "macdown"
cask "visual-studio-code"
vscode "alefragnani.bookmarks"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "jithurjacob.nbpreviewer"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mkvoya.eps-preview"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dynamics-smb.al"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "mxschmitt.postscript"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
