# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# Distributed revision control system
brew "git"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Portable Foreign Function Interface library
brew "libffi"
# General-purpose data compression with high compression ratio
brew "xz"
# YAML Parser
brew "libyaml"
# C language header files for the OpenCL API
brew "opencl-headers"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Port of pdftk in java
brew "pdftk-java"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Display directories as trees (with optional color/HTML output)
brew "tree"
